---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintCircumference
source: html/3de42bc6-f5c4-b692-e062-d0f5e71d9982.htm
---
# RebarShapeConstraintCircumference Methods

Return the Id of the parameter associated with this constraint.